#include<stdio.h>
#include<windows.h>
#include<conio.h>
#include<math.h>
//____________________________
#define N 100//产生随即颜色
//________________________________________________________________________________________________________________
extern char s_1[] = { "☆ 我为你收集了编程所有的美，放在你生日的烛台上。将能说的话都藏在花蕾里，让它成为待放的秘密。" };
extern char s_2[] = { "☆ 一碗甜甜的长寿面，筋斗的面条是我长长的祝愿，一丝丝将你缠绕到永远，愿健康与快乐、幸福和甜蜜与你日夜相伴，祝你生日快乐！" };
extern char s_3[] = { "☆ 愿我的心是一朵鲜花，盛开在你的天空下，为你的生日增添一点温馨的情调，为你的快乐增添一片美丽的光华！" };
extern char s_4[] = { "☆ 在这个值得庆贺的日子里，我虽无鲜花与美酒献礼，但心中有歌，谨祝你一生快乐。" };
extern char s_5[] = { "☆ 绿色是生命的颜色，绿色的浪漫是生命的浪漫。因此，我选择了这个绿色的世界，馈赠给你的生日。愿你充满活力，青春常在。" };
extern char s_6[] = { "☆ 当吹生日蜡烛的时候我许下心愿，当流星划过天际的时候我许下心愿，当写这个程序的时候我也许下心愿：愿正在看这个程序的人一生幸福快乐！" };
extern char s_7[] = { "☆ 你用优美的年轮编成一册散发油墨清香的日历，年年我都会在日历的这一页上用深情的想念祝福你的生日！" };
extern char s_8[] = { "☆ 在你生日的这一天，将快乐的音符，作为礼物送给你，愿您拥有365个美丽的日子，衷心地祝福你--生日快乐！" };
extern char s_9[] = { "☆ 一生中总有一些朋友难忘记；一年中总有一些日子最珍惜；从春走到冬；由陌生转为熟悉；虽不能时时问候；在特别的日子里祝你生日快乐！" };
extern char s_10[] = { "☆ 只有懂得生活的人，才能领略鲜花的娇艳，只有懂得爱的人，才能领略到心中芬芳，祝你有一个特别的生日。" };
extern char s_11[] = { "☆ 日月轮转永不断，情若真挚长相伴，不论你身在天涯海角，我将永远记住这一天。祝你生日快乐！" };
extern char s_12[] = { "☆ 在这个充满喜悦的日子里，衷心祝愿您青春长驻，愿将一份宁静和喜悦悄悄带给您，生日快乐！" };
extern char s_13[] = { "☆ 幸福、愉快、欢乐都由你的生日而来，我把至诚的祝福化成一个美丽的谜，带到你的生日宴会上来，让你猜……" };
extern char s_14[] = { "☆ 喂！老友，今天是你的大生日！在这个时刻，我要送给你千万个嘱咐与问候，这是最值钱的\"寒酸\"！" };
extern char s_15[] = { "☆ 两片绿叶，饱含着它同根生的情谊；一句贺词，浓缩了我对你的祝福。愿快乐拥抱你，在这属于你的特别的一天，生日快乐！" };
extern char s_16[] = { "☆ 祈望你心灵深处--芳草永绿，青春常驻，笑口常开。祝你生日快乐幸福！\n" };
extern char s_17[] = { "                           祝你幸福！\n" };
extern char s_18[] = { "                                                                k" };
extern char s_19[] = { "                                                                2010.9-24" };
extern char * ssum[] = { s_1, s_2, s_3, s_4, s_5, s_6, s_7, s_8, s_9, s_10, s_11, s_12, s_13, s_14, s_15, s_16, s_17, s_18, s_19 };
//________________________________________________________________________________________________________________
char randk();
void main(){
	int i = 0;
	long f = 0;
	char s[10] = "color ";
	puts("\n\n\n\n\n\n\n\n\n\n ");
	for (i = 0; i<N; i++){//要变色的次数
		s[6] = randk(); s[7] = randk();
		system(s);//调用cmd的color命令
		printf("\r                                   ★生日快乐!★");
		f = 0;
		while (f<81474400)f = f + 1;
	}

	puts("爽爽:\n\n\n");
	s[6] = 'd';//背景为d淡红色

	//输出要说的话
	for (i = 0; i<19; i++){//为要输出的行数
		puts("\n\a");
		s[7] = randk();
		system(s);//调用cmd的color命
		puts(*(ssum + i));
		f = 0;
		while (f<214748325){
			f = f + 1;
			f = f - 1;
			f = f + 1;
		}

	}

	getchar();

}

char randk(){//产生随即颜色
	char a = 0;
	a = (char)abs(rand() % 16);
	if (a >= 10){
		a -= 10;
		a += 97;
	}
	else a += 48;

	return a;
}